public/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Struktur</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Struktur</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org827e36b">Länkar till olika kapitel</a>
<ul>
<li><a href="#org73aa1be">Kursstruktur</a></li>
<li><a href="#orga784903">Lektion 1</a></li>
</ul>
</li>
<li><a href="#orgab93581">Upplägg</a>
<ul>
<li><a href="#org15e8b23">Quizzar</a>
<ul>
<li><a href="#orgff0f9d2"><span class="todo TODO">TODO</span> Quiz 1</a></li>
<li><a href="#org0602f59"><span class="todo TODO">TODO</span> Quiz 2</a></li>
<li><a href="#org2ffd2f9"><span class="todo TODO">TODO</span> Quiz 3</a></li>
<li><a href="#orgd90700c"><span class="todo TODO">TODO</span> Quiz 4</a></li>
<li><a href="#orgf5740e0"><span class="todo TODO">TODO</span> Quiz 5</a></li>
<li><a href="#orgd9be1d1"><span class="todo TODO">TODO</span> Quiz 6</a></li>
<li><a href="#org9a1f9a4"><span class="todo TODO">TODO</span> Quiz 7</a></li>
<li><a href="#org4a980d0"><span class="todo TODO">TODO</span> Quiz 8/9</a></li>
<li><a href="#org927f9af"><span class="todo TODO">TODO</span> Quiz 10</a></li>
<li><a href="#orgfe9eab3"><span class="todo TODO">TODO</span> Quiz 11/12</a></li>
<li><a href="#org32e9274"><span class="todo TODO">TODO</span> Quiz 13/14</a></li>
<li><a href="#org663344c"><span class="todo TODO">TODO</span> Quiz 16</a></li>
<li><a href="#org6c3a417"><span class="todo TODO">TODO</span> Quiz 18</a></li>
<li><a href="#orgd7ec002"><span class="todo TODO">TODO</span> Quiz 19</a></li>
<li><a href="#org553d488"><span class="todo TODO">TODO</span> Quiz 20/21</a></li>
<li><a href="#org4ae075f"><span class="todo TODO">TODO</span> Quiz 22</a></li>
<li><a href="#orgb378f46"><span class="todo TODO">TODO</span> Quiz 24/25</a></li>
<li><a href="#org2485d55"><span class="todo TODO">TODO</span> Quiz 26/27</a></li>
</ul>
</li>
<li><a href="#org890c0f0">Labbar</a>
<ul>
<li><a href="#orgc8591d0"><span class="todo TODO">TODO</span> Labb 1 - Bandbreddsmätning och felsökning i nätverkURL</a></li>
<li><a href="#orgc9bcbc7"><span class="todo TODO">TODO</span> Labb 2 - Avlyssning av nät med WiresharkURL</a></li>
<li><a href="#org56820e8"><span class="todo TODO">TODO</span> Labb 3 - Simulering av fys-lager</a></li>
<li><a href="#org056f721"><span class="todo TODO">TODO</span> Labb 4 - Bildkodning</a></li>
</ul>
</li>
<li><a href="#org2a3ea8d">Tentamen</a></li>
<li><a href="#org2c5ba72">Gamla tentor</a></li>
<li><a href="#org401e82a">Kursbok</a></li>
<li><a href="#orgedd10b8">Inspelningar</a></li>
</ul>
</li>
<li><a href="#org3029881">Mål</a></li>
</ul>
</div>
</div>

<div id="outline-container-org827e36b" class="outline-2">
<h2 id="org827e36b">Länkar till olika kapitel</h2>
<div class="outline-text-2" id="text-org827e36b">
</div>
<div id="outline-container-org73aa1be" class="outline-3">
<h3 id="org73aa1be"><a href="./index.html">Kursstruktur</a></h3>
</div>
<div id="outline-container-orga784903" class="outline-3">
<h3 id="orga784903"><a href="./lektion1.html">Lektion 1</a></h3>
</div>
</div>



<div id="outline-container-orgab93581" class="outline-2">
<h2 id="orgab93581">Upplägg</h2>
<div class="outline-text-2" id="text-orgab93581">
</div>
<div id="outline-container-org15e8b23" class="outline-3">
<h3 id="org15e8b23">Quizzar</h3>
<div class="outline-text-3" id="text-org15e8b23">
<p>
Moodle quizzar 70% rätt för godkänt. Måste göras för att få göra tentan. <a href="https://elearn20.miun.se/moodle/course/view.php?id=12368&amp;section=1">Länk</a>
</p>
</div>
<div id="outline-container-orgff0f9d2" class="outline-4">
<h4 id="orgff0f9d2"><span class="todo TODO">TODO</span> Quiz 1</h4>
</div>
<div id="outline-container-org0602f59" class="outline-4">
<h4 id="org0602f59"><span class="todo TODO">TODO</span> Quiz 2</h4>
</div>
<div id="outline-container-org2ffd2f9" class="outline-4">
<h4 id="org2ffd2f9"><span class="todo TODO">TODO</span> Quiz 3</h4>
</div>
<div id="outline-container-orgd90700c" class="outline-4">
<h4 id="orgd90700c"><span class="todo TODO">TODO</span> Quiz 4</h4>
</div>
<div id="outline-container-orgf5740e0" class="outline-4">
<h4 id="orgf5740e0"><span class="todo TODO">TODO</span> Quiz 5</h4>
</div>
<div id="outline-container-orgd9be1d1" class="outline-4">
<h4 id="orgd9be1d1"><span class="todo TODO">TODO</span> Quiz 6</h4>
</div>
<div id="outline-container-org9a1f9a4" class="outline-4">
<h4 id="org9a1f9a4"><span class="todo TODO">TODO</span> Quiz 7</h4>
</div>
<div id="outline-container-org4a980d0" class="outline-4">
<h4 id="org4a980d0"><span class="todo TODO">TODO</span> Quiz 8/9</h4>
</div>
<div id="outline-container-org927f9af" class="outline-4">
<h4 id="org927f9af"><span class="todo TODO">TODO</span> Quiz 10</h4>
</div>
<div id="outline-container-orgfe9eab3" class="outline-4">
<h4 id="orgfe9eab3"><span class="todo TODO">TODO</span> Quiz 11/12</h4>
</div>
<div id="outline-container-org32e9274" class="outline-4">
<h4 id="org32e9274"><span class="todo TODO">TODO</span> Quiz 13/14</h4>
</div>
<div id="outline-container-org663344c" class="outline-4">
<h4 id="org663344c"><span class="todo TODO">TODO</span> Quiz 16</h4>
</div>
<div id="outline-container-org6c3a417" class="outline-4">
<h4 id="org6c3a417"><span class="todo TODO">TODO</span> Quiz 18</h4>
</div>
<div id="outline-container-orgd7ec002" class="outline-4">
<h4 id="orgd7ec002"><span class="todo TODO">TODO</span> Quiz 19</h4>
</div>
<div id="outline-container-org553d488" class="outline-4">
<h4 id="org553d488"><span class="todo TODO">TODO</span> Quiz 20/21</h4>
</div>
<div id="outline-container-org4ae075f" class="outline-4">
<h4 id="org4ae075f"><span class="todo TODO">TODO</span> Quiz 22</h4>
</div>
<div id="outline-container-orgb378f46" class="outline-4">
<h4 id="orgb378f46"><span class="todo TODO">TODO</span> Quiz 24/25</h4>
</div>
<div id="outline-container-org2485d55" class="outline-4">
<h4 id="org2485d55"><span class="todo TODO">TODO</span> Quiz 26/27</h4>
</div>
</div>
<div id="outline-container-org890c0f0" class="outline-3">
<h3 id="org890c0f0">Labbar</h3>
<div class="outline-text-3" id="text-org890c0f0">
</div>
<div id="outline-container-orgc8591d0" class="outline-4">
<h4 id="orgc8591d0"><span class="todo TODO">TODO</span> Labb 1 - Bandbreddsmätning och felsökning i nätverkURL</h4>
</div>
<div id="outline-container-orgc9bcbc7" class="outline-4">
<h4 id="orgc9bcbc7"><span class="todo TODO">TODO</span> Labb 2 - Avlyssning av nät med WiresharkURL</h4>
</div>
<div id="outline-container-org56820e8" class="outline-4">
<h4 id="org56820e8"><span class="todo TODO">TODO</span> Labb 3 - Simulering av fys-lager</h4>
</div>
<div id="outline-container-org056f721" class="outline-4">
<h4 id="org056f721"><span class="todo TODO">TODO</span> Labb 4 - Bildkodning</h4>
</div>
</div>
<div id="outline-container-org2a3ea8d" class="outline-3">
<h3 id="org2a3ea8d">Tentamen</h3>
<div class="outline-text-3" id="text-org2a3ea8d">
<p>
Miniräknare medtages.
50% rätt på varje del samt 50%+ totalt.
</p>
</div>
</div>
<div id="outline-container-org2c5ba72" class="outline-3">
<h3 id="org2c5ba72">Gamla tentor</h3>
<div class="outline-text-3" id="text-org2c5ba72">
<p>
<a href="http://apachepersonal.miun.se/~mageri/kurser/mks/tentor/">Länk</a>
</p>
</div>
</div>
<div id="outline-container-org401e82a" class="outline-3">
<h3 id="org401e82a">Kursbok</h3>
<div class="outline-text-3" id="text-org401e82a">
<p>
Data communications and networking, <a href="https://github.com/aboelkassem/References_Books/blob/master/Data%20Communications%20and%20Networking%20By%20Behrouz%20A.Forouzan.pdf">Länk till bok</a>
</p>
</div>
</div>
<div id="outline-container-orgedd10b8" class="outline-3">
<h3 id="orgedd10b8">Inspelningar</h3>
<div class="outline-text-3" id="text-orgedd10b8">
<p>
Finns sedan Covid-19 åren. 32 timmar föreläsning och 8 timmar övningar. <a href="http://apachepersonal.miun.se/~mageri/kurser/mks/mks-inspelningar/2020/">Länk till videor</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org3029881" class="outline-2">
<h2 id="org3029881">Mål</h2>
<div class="outline-text-2" id="text-org3029881">
<ul class="org-ul">
<li><i>Felsöka</i> och <i>konfigurera</i> närverk.</li>
<li>Vi ska kunna <i>planera</i> och <i>designa</i> nätverk.</li>
<li>Vi ska kunna skapa egna <i>datakommunikationsprotokoll</i> eller använda redan befintliga.</li>
<li>Vi ska kunna räkna på <i>prestandamått</i> på närverk. t.ex. kapacitet, packetförluster mm.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
</div>
</body>
</html>
